INSERT INTO gener (name) VALUES
('Рок'),
('Альтернативный рок'),
('Панк-рок'),
('Фолк-рок'),
('Пауэр-метал')
;

INSERT INTO singers (name) VALUES
('Lumen'),
('Кипелов'),
('Король и Шут'),
('Fun Mode'),
('Пилот'),
('Ария'),
('Сектор Газа'),
('Эпидемия')
;

INSERT INTO geners values
(2, 1),
(3, 1),
(1, 2),
(3, 3),
(4, 3),
(1, 4),
(2, 4),
(2, 5),
(3, 5),
(4, 5),
(1, 6),
(3, 7),
(4, 7),
(5, 8)
;

INSERT INTO albom (name, year_release_albom) values 
('На части', '20120101'),
('Реки времён', '20050101'),
('Ели мясо мужики', '19990101'),
('Во Славу Одина', '20200101'),
('Тыгыдым', '20220101'),
('Герой асфальта', '19870101'),
('Вой на Луну', '20150101'),
('Призраки и Тени', '20210101')
;

INSERT INTO singers_and_albom  values
(1, 1),
(2, 2),
(3, 3),
(4, 4),
(5, 5),
(6, 6),
(7, 7),
(8, 8)
;

INSERT INTO songs (name, duration_song, albom_id) values
('Нули и единицы', '00:03:02' , 1),
('Дух времени', '00:05:52', 1),
('Призрачный взвод', '00:04:59', 2),
('Я здесь', '00:05:38', 2),
('Ели мясо мужики', '00:02:37', 3),
('Лесник', '00:03:13', 3),
('Про орков', '00:02:28', 4),
('Во славу Одина', '00:03:13', 4),
('Самый вкусный снег', '00:05:05', 5),
('Герой асфальта', '00:05:11', 6),
('Баллада о древнерусском воине', '00:08:31', 6),
('Лирика', '00:04:20', 7),
('Возле дома твоего', '00:03:05', 7),
('Призраки и тени', '00:05:04', 8),
('Письмо ведьмаку', '00:05:37', 8)
;

INSERT INTO collection  (name, year_release_collection) values
('Ария и Кипелов', '20140101'),
('КиШ и Пилот', '20090101'),
('Сектор Газа и Lumen', '19990101'),
('Fun Mode и Lumen', '20230101'),
('Пилот и Эпидемия', '20220101'),
('Старые песни', '19870101'),
('Лирика', '20150101'),
('Послушать перед сном', '20210101')
;

INSERT INTO collection_of_songs values
(3, 1),
(10, 1),
(5, 2),
(9, 2),
(1, 3),
(13, 3),
(7, 4),
(1, 4)
;